var nameDay = {"อาทิตย์": [""],
            "จันทร์": ["01418497<br>Seminar"],
            "อังคาร": ["01418442<br>Web Technology and Web Services(Lecture)", "01418442<br>Web Technology and Web Services(Lab)", 
                        "01999213<br>Environment, Technology and Life"],
            "พุธ": ["01418341<br>Intellectual Properties and Professional Ethics", "01418331 <br> Operating Systems", "01418321 <br> System Analysis and Design (Lecture)",
                    "01418321 <br> System Analysis and Design (Lab)"],
            "พฤหัสบดี" : ["01418471 <br> Introduction to Software Engineering(Lab)", "01418471 <br>Introduction to Software Engineering(Lecture)",
                    "01999213<br>Environment, Technology and Life", "01175117 <br> Meditation with Archery Activity"],
            "ศุกร์" : ["01418341<br>Intellectual Properties and Professional Ethics", "01418331 <br> Operating Systems"],
            "เสาร์" : [""]};
var subjectDetail = {"01418497<br>Seminar": ["หน่วยกิต (บรรยาย-ปฎิบัติการ): 1 วิชาที่ต้องเรียนมาก่อน: 01418221 หรือ 01418232 หรือ 01418233 การนำเสนอและอภิปรายหัวข้อที่น่าสนใจทางวิทยาการคอมพิวเตอร์ในระดับปริญญาตรี"],
                    "01418442<br>Web Technology and Web Services(Lecture)" : ["หน่วยกิต (บรรยาย): 2 วิชาที่ต้องเรียนมาก่อน: 01418211 หลักการเว็บเทคโนโลยีและเว็บบริการ ข้อกำหนดมาตรฐานของเว็บเทคโนโลยี สถาปัตยกรรมและส่วนประกอบ ลักษณะการทำงานและกลไกของระบบเว็บบริการ การพัฒนาโปรแกรมสำเร็จรูปเว็บเทคโนโลยีลักษณะการทำงานและโครงแบบเอพีไอ"],
                    "01418442<br>Web Technology and Web Services(Lab)" : ["หน่วยกิต: 1 วิชาที่ต้องเรียนมาก่อน: 01418211 หลักการเว็บเทคโนโลยีและเว็บบริการ ข้อกำหนดมาตรฐานของเว็บเทคโนโลยี สถาปัตยกรรมและส่วนประกอบ ลักษณะการทำงานและกลไกของระบบเว็บบริการ การพัฒนาโปรแกรมสำเร็จรูปเว็บเทคโนโลยีลักษณะการทำงานและโครงแบบเอพีไอ"],
                    "01999213<br>Environment, Technology and Life" : ["หน่วยกิต: 3 ความรู้เบื้องต้นเกี่ยวกับสิ่งแวดล้อม วิทยาศาสตร์ เทคโนโลยีและคุณภาพชีวิต การอนุรักษ์สิ่งแวดล้อมโดยการศึกษา แนวคิดปรัชญาเศรษฐกิจพอเพียง จริยธรรม กฎหมายและเศรษฐศาสตร์ กรณีศึกษาและมีการศึกษานอกสถานที่"],
                    "01418341<br>Intellectual Properties and Professional Ethics" : ["หน่วยกิต (บรรยาย-ปฎิบัติการ): 3(3-0-6)ประเภทของทรัพย์สินทางปัญญา การได้มาซึ่งลิขสิทธิ์ สิทธิแต่เพียงผู้เดียวของเจ้าของลิขสิทธิ์การละเมิดลิขสิทธิ์ การใช้โดยธรรม ใบอนุญาตของซอฟต์แวร์เสรีใบอนุญาตของซอฟต์แวร์เปิดเผยรหัส ใบอนุญาตให้ใช้โปรแกรมคอมพิวเตอร์ ครีเอทีฟคอมมอนส์สิทธิบัตร เครื่องหมายการค้าและเครื่องหมายการบริการ นโยบายส่วนบุคคล อาชญากรรมคอมพิวเตอร์กรณีศึกษา"],
                    "01418331 <br> Operating Systems" : ["หน่วยกิต (บรรยาย-ปฎิบัติการ): 4(4-0-8) วิชาที่ต้องเรียนมาก่อน: 01418233 พัฒนาการของสถาปัตยกรรมคอมพิวเตอร์และระบบปฏิบัติการ โครงสร้างระบบปฏิบัติการ กระบวนการและสายโยงใย การจัดกำหนดการ การติดตาย ลำดับขั้นของหน่วยความจำ การจัดการหน่วยความจำ หน่วยความจำเสมือน การจัดการระบบแฟ้ม การจัดการระบบรับเข้า/ส่งออก ความมั่นคง การป้องกัน ระบบปฏิบัติการแบบกระจาย"],
                    "01418321 <br> System Analysis and Design (Lecture)" : ["หน่วยกิต: 2 วิชาที่ต้องเรียนมาก่อน: 01418211 และ 01418221 ขั้นตอนวิเคราะห์เบื้องต้น เครื่องมือในการวิเคราะห์ระบบ ผังระบบงาน ตารางการตัดสินและต้นไม้การตัดสิน การศึกษาความเป็นไปได้ของปัญหา การวิเคราะห์ความคุ้มค่าในการลงทุน นำเข้า ส่งออกและการออกแบบ การออกแบบวิธีการประมวลผลด้วยคอมพิวเตอร์ การทำเอกสาร การนำไปใช้และการประเมินผล การพิสูจน์การออกแบบกรณีศึกษา"],
                    "01418321 <br> System Analysis and Design (Lab)" : ["หน่วยกิต: 1 วิชาที่ต้องเรียนมาก่อน: 01418211 และ 01418221 ขั้นตอนวิเคราะห์เบื้องต้น เครื่องมือในการวิเคราะห์ระบบ ผังระบบงาน ตารางการตัดสินและต้นไม้การตัดสิน การศึกษาความเป็นไปได้ของปัญหา การวิเคราะห์ความคุ้มค่าในการลงทุน นำเข้า ส่งออกและการออกแบบ การออกแบบวิธีการประมวลผลด้วยคอมพิวเตอร์ การทำเอกสาร การนำไปใช้และการประเมินผล การพิสูจน์การออกแบบกรณีศึกษา"],
                    "01418471 <br> Introduction to Software Engineering(Lab)" : ["หน่วยกิต (ปฎิบัติการ): 1 วิชาที่ต้องเรียนมาก่อน: 01418211 และ 01418221 หลักการวิศวกรรมซอฟต์แวร์ ตัวแบบกระบวนการทางซอฟต์แวร์ วิศวกรรมความต้องการ การสร้างตัวแบบซอฟต์แวร์ การออกแบบซอฟต์แวร์ สถาปัตยกรรมซอฟต์แวร์ การออกแบบแบบรูป ส่วนต่อประสานกับผู้ใช้ การทวนสอบและการตรวจสอบความสมเหตุสมผลของซอฟต์แวร์ การประกันคุณภาพ การบริหารโครงการซอฟต์แวร์"],
                    "01418471 <br>Introduction to Software Engineering(Lecture)" : ["หน่วยกิต (บรรยาย): 2 วิชาที่ต้องเรียนมาก่อน: 01418211 และ 01418221 หลักการวิศวกรรมซอฟต์แวร์ ตัวแบบกระบวนการทางซอฟต์แวร์ วิศวกรรมความต้องการ การสร้างตัวแบบซอฟต์แวร์ การออกแบบซอฟต์แวร์ สถาปัตยกรรมซอฟต์แวร์ การออกแบบแบบรูป ส่วนต่อประสานกับผู้ใช้ การทวนสอบและการตรวจสอบความสมเหตุสมผลของซอฟต์แวร์ การประกันคุณภาพ การบริหารโครงการซอฟต์แวร์"],
                    "01175117 <br> Meditation with Archery Activity" : ["การพัฒนาสมาธิด้วยกิจกรรมยิงธนู ทักษะและความรู้พื้นฐานการยิงธนู การ ประยุกต์กิจกรรมยิงธนูเพื่อพัฒนาสมาธิไปสู่วิถีชีวิตการออกกำลังกายและการส่งเสริม สุขภาพในชีวิตประจำวัน"],
                    "" : [""]};

function display(day){
    var x = nameDay[day];
    console.log(day);
    console.log(nameDay[day]);
    console.log(x);
    var y = "";
    console.log(x.length);
    for (var i=0; i<x.length; i++){
        var sub = x[i].replace("<br>", "");
        y+=sub+"<br>";
        var detail = subjectDetail[x[i]];
        //console.log(detail);
        
        for (var j=0; j<detail.length ; j++){
            y+=detail[j]+"<br>";
        }
        y+="<br>";
    }
    document.getElementById("myDisplay").innerHTML = y;
}